9zigen/nRF52_SoilSensor/ble_services.c
/* Advertising  data format */

/* Function for initializing the Advertising functionality. */
void advertising_init(void)
{
  ret_code_t             err_code;
  ble_advertising_init_t init;

  memset(&init, 0, sizeof(init));

  ble_advdata_manuf_data_t manuf_data; //Variable to hold manufacturer specific data

  /* Our data to advertise */

  /* Data Format
   * bat_%(8bit) ->
   * temp_x100(16bit) ->
   * hum_x100(16bit) ->
   * soil(16bit) ->
   * ec(16bit) = 9 byte */

  uint8_t temperature;
  temperature                         = (uint8_t) (shtc_get_temperature() / 100);

  uint8_t humidity;
  humidity                            = (uint8_t) (shtc_get_humidity() / 100);

  u16_to_u8_t salinity;
  salinity.u16                        = get_raw_salinity();

  u16_to_u8_t soil;
  soil.u16                            = get_soil_level();

  u32_to_u8_t light;
  light.u32                           = get_visible_lux();

  uint8_t data[11];

  /* bat */
  data[0]                             = get_battery_capacity();

  /* temp */
  data[1]                             = temperature;

  /* hum */
  data[2]                             = humidity;

  /* ec */
  data[3]                             = salinity.u8[0];
  data[4]                             = salinity.u8[1];

  /* soil */
  data[5]                             = soil.u8[0];
  data[6]                             = soil.u8[1];

  /* light */
  data[7]                             = light.u8[0];
  data[8]                             = light.u8[1];
  data[9]                             = light.u8[2];
  data[10]                            = light.u8[3];

  manuf_data.company_identifier       = 0xffff; //You company ID
  manuf_data.data.p_data              = data;
  manuf_data.data.size                = sizeof(data);
  init.srdata.p_manuf_specific_data   = &manuf_data;

  init.advdata.name_type              = BLE_ADVDATA_FULL_NAME;
  init.advdata.include_appearance     = true;
  init.advdata.flags                  = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

  init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
  init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

//  init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
//  init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

  init.config.ble_adv_fast_enabled    = true;
  init.config.ble_adv_fast_interval   = APP_ADV_INTERVAL;
  init.config.ble_adv_fast_timeout    = APP_ADV_DURATION;
  init.config.ble_adv_slow_enabled    = true;
  init.config.ble_adv_slow_interval   = APP_ADV_SLOW_INTERVAL;
  init.config.ble_adv_slow_timeout    = APP_ADV_SLOW_DURATION;

  init.evt_handler = on_adv_evt;

  err_code = ble_advertising_init(&m_advertising, &init);
  APP_ERROR_CHECK(err_code);

  ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
  APP_ERROR_CHECK(err_code);

//  for (int i = 0; i < m_advertising.adv_data.adv_data.len; ++i) {
//    NRF_LOG_INFO("%dx%x", i, m_advertising.adv_data.adv_data.p_data[i]);
//  }
//  for (int i = 0; i < m_advertising.adv_data.scan_rsp_data.len; ++i) {
//    NRF_LOG_INFO("%dx%x", i, m_advertising.adv_data.scan_rsp_data.p_data[i]);
//  }
}

/* Function for update manufacturer data */
void adv_manuf_data_update()
{
  uint8_t temperature;
  temperature             = (uint8_t) (shtc_get_temperature() / 100);

  uint8_t humidity;
  humidity                = (uint8_t) (shtc_get_humidity() / 100);

  u16_to_u8_t salinity;
  salinity.u16            = get_raw_salinity();

  u16_to_u8_t soil;
  soil.u16                = get_soil_level();

  u32_to_u8_t light;
  light.u32               = get_visible_lux();

  /* bat */
  manuf_data_array[0]     = get_battery_capacity();

  /* temp */
  manuf_data_array[1]     = temperature;

  /* hum */
  manuf_data_array[2]     = humidity;

  /* ec */
  manuf_data_array[3]     = salinity.u8[0];
  manuf_data_array[4]     = salinity.u8[1];

  /* soil */
  manuf_data_array[5]     = soil.u8[0];
  manuf_data_array[6]     = soil.u8[1];

  /* light */
  manuf_data_array[7]     = light.u8[0];
  manuf_data_array[8]     = light.u8[1];
  manuf_data_array[9]     = light.u8[2];
  manuf_data_array[10]    = light.u8[3];

//  NRF_LOG_INFO("ADV Light Lux: 0x%x",*(uint32_t*)&manuf_data_array[7]);

}

/* Function to change Advertising data */
void advertising_update()
{
  ret_code_t ret_code;

  static bool buffer_index; // We alternate between two data buffer in order to hot-swap
  static ble_gap_adv_data_t new_data;
  ble_gap_adv_data_t *old_data  = &m_advertising.adv_data;

  // Copy advertising data
  static uint8_t data[2][BLE_GAP_ADV_SET_DATA_SIZE_MAX];
  new_data.adv_data.p_data      = data[buffer_index];
  new_data.adv_data.len         = old_data->adv_data.len;
  memcpy(new_data.adv_data.p_data, old_data->adv_data.p_data, old_data->adv_data.len);

  // Copy scan response data
  static uint8_t scan_data[2][BLE_GAP_ADV_SET_DATA_SIZE_MAX];
  new_data.scan_rsp_data.p_data = scan_data[buffer_index];
  new_data.scan_rsp_data.len    = old_data->scan_rsp_data.len;
  memcpy(new_data.scan_rsp_data.p_data,
         old_data->scan_rsp_data.p_data,
         old_data->scan_rsp_data.len);

//  for (int i = 0; i < BLE_GAP_ADV_SET_DATA_SIZE_MAX; ++i) {
//    NRF_LOG_INFO("%x", new_data.scan_rsp_data.p_data[i]);
//  }

  // Update manufacturer specific data
  const uint8_t manuf_data_offset = 4;
  adv_manuf_data_update();
  memcpy(&new_data.scan_rsp_data.p_data[manuf_data_offset],
         &manuf_data_array,
         sizeof(manuf_data_array));

  ret_code = ble_advertising_advdata_update(&m_advertising, &new_data, true);
  APP_ERROR_CHECK(ret_code);

  buffer_index = !buffer_index;
}

/* Function for starting advertising. */
void advertising_start()
{
  ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
  APP_ERROR_CHECK(err_code);
}

/* Function for update sensor data char. */
void update_sensors_service(sensor_t sensor_id)
{
  ret_code_t err_code;

  uint8_t battery_level = get_battery_capacity();             /* in percentage */
  uint16_t temperature  = (uint16_t) shtc_get_temperature();  /* in celsius x100 */
  uint16_t humidity     = shtc_get_humidity();                /* in percentage x100 */
  uint16_t soil         = get_soil_level();                   /* in mv, Wet<2300>Dry */
  uint16_t salinity     = get_raw_salinity();                 /* in uS, micro siemens */
  uint32_t light        = get_visible_lux();                  /* in Lux 550nm max sensitivity */

  switch (sensor_id)
  {
    case BATTERY_SENSOR:
      err_code = ble_cus_soil_update(&ble_cus, soil);
      err_code = ble_bas_battery_level_update(&m_bas, battery_level, BLE_CONN_HANDLE_ALL);
      break;

    case TEMPERATURE_SENSOR:
      err_code = ble_cus_temperature_update(&ble_cus, temperature);
      APP_ERROR_CHECK(err_code);
      break;

    case HUMIDITY_SENSOR:
      err_code = ble_cus_humidity_update(&ble_cus, humidity);
      APP_ERROR_CHECK(err_code);
      break;

    case SALINITY_SENSOR:
      err_code = ble_cus_salinity_update(&ble_cus, humidity);
      APP_ERROR_CHECK(err_code);
      break;

    case SOIL_SENSOR:
      err_code = ble_cus_soil_update(&ble_cus, salinity);
      APP_ERROR_CHECK(err_code);
      break;

    case LIGHT_SENSOR:
      err_code = ble_cus_light_update(&ble_cus, light);
      APP_ERROR_CHECK(err_code);
      break;
  }

}

/* Function for init ble. */
void init_ble()
{
  ble_stack_init();
  gap_params_init();
  gatt_init();
  services_init();
  advertising_init();
  conn_params_init();
  peer_manager_init();
  advertising_start();
}